import 'package:flutter_application_1/gen/assets.gen.dart';

class HomeViewList {
  String? name;

  HomeViewList({required this.name});
}

List<HomeViewList> HomeViewData = [
  HomeViewList(name: "حجاب و عفاف"),
  HomeViewList(name: "شعرها"),
  HomeViewList(name: "دلنوشته شهدا"),
  HomeViewList(name: "اسلام از منظرهای مختلف"),
  
];


class Articles {
  String? title;
  String? image;
  String? text;

  Articles({required this.title, required this.image, required this.text});
}

List<Articles> hijabContant = [

  Articles(title: "نقش عفاف وحجاب در تقویت", image: Assets.images.a3a.path, text: """
در هر جامعه نوع و کیفیت لباس زنان و مردان افزون بر آنکه از شرایط اقتصادی، اجتماعی و اقلیمی آن جامعه پیروی میکند، قویاً تابع جهان بینی و ارزشهای حاکم بر فرهنگ آن جامعه و حتی مبیّن و آیینه آن جهانبینی است. لباس نه تنها تحت تأثیر فرهنگ جامعه است، بلکه معرّف شخصیت تک تک افراد و در نتیجه فرهنگ عمومی جامعه نیز است. 
نیروی حیا و عفاف که عنصری درونی و روحی است، تدبیری از سوی خداوند برای کنترل آنان بر استفاده درست از جمال و جذابیت خود در عرصه ی زندگی و جامعه است. حجاب و عفاف پدیده ی دینی ـ فرهنگی مهمی در تعالیم اسلامی و توجه به زمینه های فرهنگی ـ اجتماعی به عنوان بستر آن بسیار شایسته و لازم است و اشاعه و تعمیق آن نیازمند آموزشهای بنیادین و مداوم در خانواده، مدرسه، دانشگاه و اجتماع است. 
یکی از اساسی‌ترین دلایل اهتمام اسلام به نفس پوشش، توجه مقام ربوبی به ویژگی تنوع‌طلب انسان است، که اگر مهاری از منطق و عقلانیت را فراروی خود مشاهده نکند، مسیر کمال را فروگذارده و به سیری نزولی روی خواهد آورد. نکته¬ی ظریف و در عین حال علمی این امر آن است که به طور کلی طبیعت و روح انسان کمال جو و طالب بی نهایت است، انحراف در این مسیر می تواند وی را در راستای طلب بی¬حد و حصر مادیات قراردهد. یکی از ابعاد مادی¬گرایی بشر توجه بیش از حد به جاذبه¬های جسمی و جنسی است. بنابراین تأکید بر پوشش مبتنی بر شناخت وجوه گوناگون بشری است و در عین حال مهاری است بر بخش افزون خواه مادی، تا راه را برای گرایشات متعالی بشر باز کند.
"""),

  Articles(
      title: "نقش عفاف وحجاب در متون آموزشی",
      image: Assets.images.a1a.path,
      text:
          """یکی از نیازهای حقیقی در زمینه‌های تربیتی، دینی، اخلاقی و فرهنگی، مسئلة حجاب است. هرچه الگوهای حجاب مراتب برتر و بالاتری داشته باشند، تأثیر بیشتری بر معنویّت و دینداری فرد و جامعه خواهند گذاشت و هرچه حجاب فردی و اجتماعی، متعالی باشد، تقدّس و حرمت اخلاقی و رشد و تعالی جامعة اسلامی بیشتر خواهد بود. حجاب آثار تربیتی در دو زمینة فردی و اجتماعی دارد که مهم‌ترین آثار حجاب در بُعد فردی، شخصیّت، سلامت جسمانی، استحکام خانواده، آرامش و امنیّت و در بُعد اجتماعی، مسئولیّت اجتماعی، آزادی زن، سلامت اخلاقی جامعه و حفظ نیروی کار اقتصادی و حفظ استقلال فرهنگی است. این مقاله به بررسی مفهوم حجاب و آثار تربیتی آن می‌پردازد. این بررسی از نوع توصیفی‌ـ تحلیلی است. روش گردآوری اطّلاعات کتابخانه‌ای و روش تجزیه و تحلیل اطّلاعات تحلیل محتواست."""),


  Articles(
      title: "معیار حجاب در ازدواج ازنظر اسلام",
      image: Assets.images.a4a.path,
      text:
          """
اساس حجاب در ازدواج از دیدگاه اسلام در ابعاد زیادی مورد بررسی قرار گرفته است. معیارهایی که می تواند آینده یک زندگی خوب و زیبا را فراهم نماید و اگر در انتخاب این معیار ها دقت نکنید ممکن است زندگی خوب و زیبا تبدیل به یک نوع زندگی دیگر شود و از آن پشیمان شوید، معیار حجاب در ازدواج نقش زیادی در انتخاب همسر دارد. از رو دختر و پسر قبل از ازدواج باید سوالات خواستگاری در مورد حجاب را از یگ دیگر بپرسند تا از شرایط و علایق همدیگر با خبر باشند.

چنانچه امام حسن (ع) می فرماید: با مردان و زنانی با تقوا ازدواج کنید که اگر شما را دوست دارند شما را گرامی بدانید و اگر دوستتان ندارند به شما ستم نمی کنند.

اهمیت معیارهای ازدواج از دیدگاه اسلام به قدری مهم است که هم کف بودن و هماهنگ بودن را مهم ترین اصل در انتخاب همسر می دانند.اگر زن و مرد هر دو به حجاب خود اهمیت بدهند و از نگاه به نامحرمان خودداری نمایند، زندگی زوجین قطعا سرشار از آرامش و به دور از هر گونه بحث و جدل خواهد بود. به همین منظور در دین اسلام توصیه می شود تا همسر خود را بر اساس معیار حجاب برگزینید تا همواره زندگی خوشایندی را تجربه کنید.به چند مورد از این عوامل اشاره خواهیم کرد:

عدم شناخت کافی نسبت به همسر و خانواده او
سبک زندگی خانواده طرفین
عوامل فرهنگی
شیوه های همسر گزینی هر یک از خانواده ها
عوامل شخصیتی و تفاوت های فردی
اختلاف مذهبی در ازدواج
تفاوت از لحاظ انگیزش
تفاوت فردی در هوش
ایمان و دینداری
اخلاق نیک
جمال و زیبایی"""),


  Articles(
      title: "نقش حجاب در حفاظت و ارتقاء سلامت ",
      image: Assets.images.a7a.path,
      text:
          """
دستورات اسلام پیرامون آیات حجاب در احیای فرهنگ عفاف و پاكدامنی و سلامت خانواده و اجتماع بسیار موثر بوده و تحول چشمگیری ایجاد نمود . « فَلَمَّا ذَاقَا الشَّجَرَةَ بَدَتْ لَهُمَا سَوْءَاتُهُمَا وَطَفِقَا یَخْصِفَانِ عَلَیْهِمَا مِن وَرَقِ الْجَنَّةِ » آنگاه كه آدم و حوا از آن درخت ممنوعه چشیدند پوشش خود را از دست دادند و به سرعت با برگ درختان بهشتی خود را پوشاندند . لباس پوشیدن شأنی ازشئون انسانی است و پدیده ای است كه تقریباً به اندازه طول تاریخ بشر سابقه و به قدر بهینة جغرافیای امروزین زمین گسترش دارد . این پدیده با خصوصیات مختلف فردی و اجتماعی انسان در ارتباط است و میتوان آنرا از دیدگاههای مختلفی از قبیل روانشناسی ، اخلاق ، اقتصاد ، جامعه شناسی ، مذهب ، قانون ، تاریخ و جغرافیا مورد مطالعه قرار داد . از مجموع تحقیقاتی كه بعمل آمده ، مسلم شده كه لباس دست كم پاسخگوی سه نیاز آدمی است یكی اینكه او را از سرما و گرما و برف و باران حفظ می كند ، دیگر اینكه در جهت حفظ عفاف و شرم به او كمك می كند و بالاخره به او آراستگی و زیبائی و وقار می بخشد .  آیه 30 - از سوره نور چنین می گوید : ای رسول گرامی به زنان با ایمان بگو دیدگان خود را از نگاه به مردان نامحرم فرو بخوابانند و دامان خویش را از هوس رانی حفظ كنند و زینت خود را آشكار ننمایند مگر آنچه نمایان است و روسری های خود را بر سینه و گردن خود بیافكنند تا پوشیده گردد و زیور خویش را آشكار نكنند و ...
"""),




  Articles(
      title: "حجاب و عفاف",
      image: Assets.images.a11a.path,
      text:
          """یه نفر بهش گفت آخه تو این گرما با این چادر مشکی چطوری میتونی طاقت بیاری
گفت شنیدم آتش جهنم خیلی گرمتره."""),

  Articles(
      title: "چـــــــــــــــادر",
      image: Assets.images.a10a.path,
      text: """چـــــــــــــــادر تو تلافی غروبی است…
که در آن روز به زور چادر از سر زنان حرم پیامبر می‌کشیدند…
چادر تو میراث خون دل‌های خیمه نشینان ظهر عاشوراست …
و چادر سرکردنت به همین سادگی انتقام کربــــــــــــــــلا ست…."""),
  Articles(
      title: "چادر من!",
      image: Assets.images.a9a.path,
      text: """چادر من! تو با من بزرگ شدی! با لحظه‌های زندگیم همراه بودی
با من زیر باران ماندی و خیس شدی
با من قد کشیدی  تغییر کردی  با من زیر آفتاب گرمت شد …
رنگ مشکی ات زیر نور آفتاب رنگ باخت تا رنگ از زندگی ام نبازد"""),
  Articles(
      title: "نارس",
      image: Assets.images.a8a.path,
      text: """نارس بودی، حیا شکوفایت کرد
ایمان تو نامدار دنیایت کرد

یک سکه بی رواج بودی ای ماه!
این چادر شب بود که زیبایت کرد"""),
  Articles(
      title: "چادرِ من",
      image: Assets.images.a7a.path,
      text: """نه برای نشان دادن فقر در سریال‌های تلویزیونی کشورم است …
نـه لبـاس متهمـان ِ دادگـاه و زنـدان هـا …
چـادر مـن تـاج بنـدگـی مـن است …
سنـد زهرایی بـودنم را امضا میکند …"""),
  Articles(
      title: "دختران خودنما",
      image: Assets.images.a6a.path,
      text: """دختران خودنما در چشم‌ها جای دارند.
ولی دختران عفیف در دل ها.
زیرا حجاب یعنی به جای شخص.
شخصیت را دیدن"""),
  Articles(
      title: "زنان خوب",
      image: Assets.images.a5a.path,
      text:
          """زنان خوب میراث دار عفاف فاطمه و مریم‌اند، دریغا که بازیچه هوس شوند و به ویروس گناه آلوده گردند."""),
  Articles(
      title: "بی حجابی",
      image: Assets.images.a4a.path,
      text: """بیا فکر کنیم حجاب محدودیت است
من آزادانه عاشقت هستم‌ ای دوست داشتنی ترین محدودیت دنیا…"""),
  Articles(
      title: "بی حجابی",
      image: Assets.images.a3a.path,
      text: """بیا فکر کنیم حجاب محدودیت است
من آزادانه عاشقت هستم‌ ای دوست داشتنی ترین محدودیت دنیا…"""),
  Articles(
      title: "حجاب یعنی...",
      image: Assets.images.a2a.path,
      text: """حجاب یعنی به جای شخص، شخصیت را دیدن.
حجاب یعنی به همه‌ی نا محرمان و ظاهر بینان “نه” گفتن.
حجاب آوای ملکوتی جمال طلبی معنوی زن است.
حجاب تلالو شبنم بر چهره‌ی زیبای گل است.
حجاب تضمینی برای تداوم خط زیبای شرافت است.
حجاب تداوم بخش آیه‌های مهربانی متقابل همسران است.
حجاب بوته‌ی خوشبوی گل عفاف است.
حجاب سپری است قوی در برابر شمشیر‌های تهاجم فرهنگی.
حجاب سند اطاعت از فرمانده هستی است.
حجاب زنجیری گران بر دست‌های دیو گناه است.
حجاب گام‌های بلند انسان در کوچه‌های معانی است…"""),
  Articles(
      title: "مروارید",
      image: Assets.images.a1a.path,
      text:
          """وقتی مروارید زیبایی هایت را به صدف حجاب و عفاف می‌سپاری، خدا تو را آبی می‌کند. آنقدر آبی که آسمان به تو رشک می‌برد…."""),
  Articles(
      title: "حجاب مانند خورشید",
      image: Assets.images.a11a.path,
      text:
          """همانگونه که خورشید زیبایی خود را هنگام پوشاندن ابرها از دست نمی دهد، زیبایی شما در هنگام پوشش حجاب محو نمی‌شود"""),


            Articles(
      title: "رعایت حجاب",
      image: Assets.images.a1a.path,
      text: """من برای رعایت حجاب خودم هزاران دلیل دارم:
جلب رضایت خدا
آرامش روانی
انقراض بی بند و باری
آرامش فردی و اجتماعی
تقویت تمرکز
تحکیم بنیان خانواده
کاهش خیانت و نا امنی
شکر نعمت زیبایی
و تقویت شأن و منزلت زن، تنها برخی از دلایل منه برای تقید به حجاب اسلامی…
"""),
  Articles(
      title: "من شکایت دارم…",
      image: Assets.images.a2a.path,
      text: """از آن ها که نمی فهمند چادر مشکی من یادگار مادرم زهراست
از آن ها که به سخره می گیرند قـداسـتِ حجابِ مادرم را ؛
چـــــرا نمی فهمی؟
این تکه پارچه ی مشکی، از هر جنسی که باشد
حـــُرمــت دارد !"""),
  Articles(
      title: "حجاب",
      image: Assets.images.a4a.path,
      text: """احترام به حرمت‌های الهی ست
و
چادر – حجـاب برتر –
بله‌ی بلند من است به یکتا معشوق عالم، به خدای مهربانم"""),
  Articles(
      title: "حجاب",
      image: Assets.images.a7a.path,
      text: """احترام به حرمت‌های الهی ست
و
چادر – حجـاب برتر –
بله‌ی بلند من است به یکتا معشوق عالم، به خدای مهربانم"""),
];

List<Articles> delNeveshteh = [

  Articles(title: "شعر 1", image: Assets.images.sher.path, text: """بیا
که از رگ گردن به هم
نزدیک تر شویم
ای تنها امت من !
“پیامبر” تر از این می شوم اگر
تو “سرزمینم” باشی
که رسالتم این بود
مرا به تو مصلوب کنند
ایمان بیاور سرزمینم !
ایمان بیاور !
قرار است امشب
در میان بازوان تو “کتابی” نازل شود."""),

  Articles(title: "شعر2", image: Assets.images.sher.path, text: """در سکوت زمین گره خوردیم
و دانستیم
گناه
پرده ای بود آویزان
از چهار چوبِ لقِ پنجره یِ ایمان
پشت این پنجره
اما
هیچ.
هیچ."""),

  Articles(title: "شعر 3", image: Assets.images.sher2.path, text: """    ای وای که این خرمن سوزان بسر آید

    وین راه سراسر گنه وشورو پریشان بسرآید

    یاران!همه هستی ما نیست پشیزی

    ای کاش که این عمر به ایمان بسر آید"""),

  Articles(title: "شعر 4", image: Assets.images.sher.path, text: """تو چقدر نزدیکی به من و زندگییم!
همه اسرارم را به صندوقچه ی دلت قفل زدم
و تو شدی یک محرم
به تو ایمان دارم
به صفایت میبالم!
که تو منی یا من تو شک دارم!
من و تو سهم همیم!!!
دو نفر در یک سو!
و محال است خیانت بکنیم
به تو ایمان دارم….."""),


  Articles(title: "شعر 5", image: Assets.images.sher2.path, text: """خواهم از هجر تو در خانه بگریم
وای در خانه خود باز غریبانه بگریم
ای که من بنده ی دیدار توام
شده ای مسجد ایمان دلم
زلف زیبای تو سجاده ی من
مهر سجاده کنم خال تو را
کنج ابروی تو محراب دعا"""),


  Articles(title: "شعر 6", image: Assets.images.sher.path, text: """    عاشقی کرده طلب معرفت از عشق مجو
    حرف از استغنا به حیرت نزد درویش مگو

    چون نکرده شک ز ایمان نزد ما دم میزنی
    از فنا ترسیده ای پیمانه ای کم میزنی؟"""),


  Articles(title: "شعر 7", image: Assets.images.sher.path, text: """در هُرم نفس‌های تو جان خواهم داد
خود را به جهان، باز نشان خواهم داد
ای خاطره انگیزترین نام جهان!
با نام تو، ایمان به جهان خواهم داد"""),


  Articles(title: "شعر 8", image: Assets.images.sher2.path, text: """    هیچ اندیشی

    اهورامزدا

    سایه ی ایمان را

    روی چشم دانش

    می ریزد

    و نگاه خاموش

    پای در تاریکی

    فتنه می انگیزد ؟"""),

];


List<Articles> Shohada=[

  Articles(title: "نمیدانست او",
   image: Assets.images.a11a.path,
  text: """نمیدانست وقتی دارد پشت سرت آب میریزد آخرین بار است .نمیدانست وقتی برگشتی و نگاهش کردی آخرین بار بود. اگر میدانست آنقدر به تماشایت مینشست که او را هم با خود بیری مادر نمی دانست سفارشاتت به ما برای چیست مادر نمی دانست نگاه نگرانت از گوشه چشمانت به ما برای چیست مادر نمیدانست چرا در حال رفتن برگشتی و نگاهش کردی مادر نمی دانست خداحافظی بی برگشت چیست مادر نمی دانست… اما حال خوب می داند. خوب میداند تنهایی چیست خوب میداند دلتنگی چیست خوب می داند استخوان ندیده چیست خوب می داند تشیع بی جنازه چیست حال خوب از بر است پدر بودن را آن روزها فقط شنیده بوداما حال با تمام وجودش لمسش کرده . کاش مادر می دانست. از فاطمه ………………"""),

    Articles(title: "کجایند آنان که در صحنه پیکار",
   image: Assets.images.a3a.path,
  text: """کجایند آنان که در صحنه پیکار ، شمشیرهاشان را از غلاف بیرون کشیده ، هر گوشه از میدان نبرد را دسته دسته و صف به صف فرا می گرفتند ؟ آنان جوانمردانی بودند که در پایان هر مصاف از بقاء زندگانی بازگشته از کارزار سپاه خود ، شادمان نمی شدند و از بابت مرگ سرخ کشتگانشان از کسی تسلیت نمی خواستند ، چشمانشان از شدت گریه خوف بر درگاه جلال ربویی به سفیدی گراییده ، شکم هاشان بر اثر روزه داری لاغر گشته و پوست لبانشان بر اثر مداومت بر دعا و ذکر حق خشکیده. رنگ رخسارشان از فرط شب بیداری زرد گشته و غبار فروتنی و تواضع چهرهاشان را پوشانده آنان برداران من هستند که از این سرای فانی سفر می کنند پس سزاوار است که تشنه دیدارشان باشیم و از اندوه فراقشان انگشت حسرت بر لب بگزیم . امیرالمومنین علی (ع) – نهج البلاغه – کلام 120 از کیمیا……………………………………………….."""),

    Articles(title: "شهید گمنام….",
   image: Assets.images.a1a.path,
  text: """آرام آرام قاصدکهای رسیده از سفری دور ، همراه نسیمی مهربان به دشت آلاله ها می رسند .
هر قاصدک بر گلبن لاله ای می نشیند تا خستگی و رنج این سفر دور و دراز را برای لاله اش بازگو کند .
فرشتگان به ضیافت این دشت می آیند و بالهایشان را فرش راه قاصدکها می کنند.
اما!
کمی آنطرف تر، دل خستگانی که به پهنای دل آسمان گریسته اند تابوتهایی خالی را بر دوش خود حمل می کنند
با اینکه تابوت خالیست اما سنگینی عجیبی را بر پشتشان احساس می کنند
صاحبان آن تابوتها همان قاصدکها هستند که سبکبار! به سمت مقصد خویش پرواز کرده اند
اما چرا آنطرفتر صدای گریه می آید؟!
آن همه غم و سوختگی سینه برای چیست؟
انگار هر کسی نجوایی در گوش تابوتی دارد و روی آن چیزی می نویسد
شعر می نویسند؟
آرزوها و امیدها را می نویسند؟
از دل تنگی ها و قصه هجران می سرایند؟
از سختی هایی که کشیده اند؟
از نامردی ها و ناجوانمردی ها؟
از کسانی که حرمت نان و سفره را نگه نمی دارند؟
از بی درد ها ی بی غم و غصه که برای خوش گذرانی دو روزه دنیا کبوتر ها را در قفس زندانی کردند و به پرواز بی سرانجام آنان می خندند؟!
از لگدهایی که روی خونهای پاک کوبیده شده!؟
اما نه!
از رد پای خون گریزی نیست!
این خونها پاک شدنی نیستند
مگر می شود فراموش کرد آن همه پاکی
آن همه صفا و صمیمیت
رشادت
شجاعت
جوانمردی
و آن همه عشق خدایی را!!!
و او همچنان می نویسد………….
اما پهنه تابوت به وسعت همه درد دلهایش نیست
چرا که تابوت نیز دلتنگ پیکریست که از دیار غربت به دیار غربت!
سفر می کند………..

تو فرزند کدام نسل پاکی؟
تو از کدامین دشت روییده ای قاصدک!؟
چه کسی سینه دریاییت را پاره پاره کرده؟
کدام دست ناپاک خون پاک تو را ریخته؟
به کجا سفر می کنی؟
دور از خانه و شهر خویش؟!
دور از دستهای پینه بسته پدر و قلب شکسته مادر!؟
سبز و آباد باد! آن خاکی که سینه اش را آرامگاه پیکر پاک تو کرده
و خوش بر آن آسمانی که سایه بان آن خاک شده!

و ما باز هم شرمنده ایم . از مینا…………………………………………………………….."""),

Articles(title: "کجایند آنان که در صحنه پیکار",
   image: Assets.images.a10a.path,
  text: """بارها که بر قبور آسمانی شهدا قدم می گذارم ، زمزمه ای شیرین با بی نشانی تو از زبان من جاری می شود. نمی دانم که در نجوای صادقانه خود با خاک چه زمزمه کردی که این چنین آغوش محبتش را برایت گشود و اکنون با گذشت سالها میل بر پس دادن تو ندارد !نمی دانم که دل پاک و آسمانی ات چگونه به عرش اعلی پیوند خورد که چنین تجلی نور حق تعالی حتی جسم تو را از نشانه ها به دور ساخت .نمی دانم چه بر جان چشاندی که چنین مست شراب الهی گشتی که حتی برای پیکر پاکت مأوایی بهتر از گمنامی و بی نشانی نیافتی . نمی دانم که در دامان نیایش شب هایت چه ذکری سر دادی که حتی عشق عالم امکان ، عاشقت گشت و تو را با تمام وجود از آن خود ساخت . شاید با دردِ ماندن سوخته بودی که چنین پاداشی نصیب رفتنت شد ، تصورم این است تو آنقدر با درد ماندن ساخته بودی که تمام افلاکیان برای پرواز عروج آسمانیت شرافت خود را نزد پروردگار عالمیان به ضمانت نهادند و این را خودم از زبان مأوایت که خاک کربلای ایران بود شنیدم. دو کوهه با من سخن گفت : از غربت شهدا ء ، از اشک شوقشان ، از طاعت مستانه شان ، از ناله های سوزناکشان . گفت و شنیدم ، گفت و باریدم . از عرفانه…………………………………..""")
  ,

Articles(title: "سلام بر شهدا",
   image: Assets.images.a2a.path,
  text: """سلام بر آنهایی که از نفس افتادند تا ما از نفس نیفتیم، قامت راست کردند تا ما قامت خم نکنیم، به خاک افتادند تا ما به خاک نیفتیم سلام بر آنهایی که رفتند تا بمانند و نماندند تا بمیرند. سلام بر شهدا!"""),
  
  Articles(title: "«آرزوی شهدا»",
   image: Assets.images.a5a.path,
  text: """گفتم:« ببینم توی دنیا چه آرزویی داری؟»

قدری فکر کرد و گفت:« هیچی»

گفتم:« یعنی چی؟ مثلاً دلت نمی‌خواد یک کاره‌ای بشی، ادامه تحصیل بدی یا از این حرفها دیگه»

گفت:« یک آرزو دارم. از خدا خواستم تا سنم کمه و گناهم از این بیشتر نشده، شهید بشم.»
h

""شهید نور الله اختری""


برگرفته شده از sire-shohada.blog.ir
"""),
  

    Articles(title: "«آرزوی شهدا»",
   image: Assets.images.a6a.path,
  text: """شهید حسن طهرانی مقدم(پدر موشکی ایران):

فقط انسان های ضعیف به اندازه امکاناتشان کار می کنند...


برگرفته شده از sire-shohada.blog.ir

"""),

    Articles(title: """«کم شد ز جمع خسته دلان یار دیگری...»
""",
   image: Assets.images.a6a.path,
  text: """شهید حسن طهرانی مقدم(پدر موشکی ایران):

فقط انسان های ضعیف به اندازه امکاناتشان کار می کنند...


برگرفته شده از sire-shohada.blog.ir

"""),


  
  ];



List<Articles> eslam=[
  Articles(title:"معنای لغوی دین" , image: Assets.images.a10a.path, text: """"معنای لغوی دین، انقیاد، خضوع، پیروی، اطاعت، تسلیم و پاداش است. امّا معنای اصطلاحی آن، مجموعه عقاید، اخلاق، قوانین و مقرراتی است که برای اداره امور جامعه انسانی و پرورش انسان ها باشد.در تفسیر «دین»، آرا و مطالب گوناگونى از سوى غربیان مطرح شده است. «جان هیک» در کتاب «فلسفه دین» تعاریف گوناگونى از دیدگاه هاى مختلف درباره دین نقل مى کند"""),
  
  Articles(title:"تعریف روان شناختى" ,
   image: Assets.images.a10a.path, 
   text: """
«دین احساسات، اعمال و تجربیات افراد در هنگام تنهایى، آن گاه که خود را در برابر هر آنچه که الهى مى نامند، مى یابند». (ویلیام جیمز)"""),
  
  Articles(title:" تعریف جامعه شناختى" ,
   image: Assets.images.a10a.path,
    text: """«مجموعه اى از باورها، اعمال، شعایر و نهادهاى دینى که افراد بشر در جوامع مختلف بنا کرده اند». (تالکوت پارسونز)"""),

  
  Articles(title: """تعریف طبیعت گرایانه""", image: Assets.images.a10a.path, text: """
«مجموعه اى از اوامر و نواهى که مانع عملکرد آزاد استعدادهاى ما مى شود». (اس. رایناخ) و همان رویکرد با همدلى بیشتر: « دین همان اخلاق است که احساس و عاطفه به آن تعالى، گرما و روشنى بخشیده است». (ماتیو آرنولد)"""),

  
  Articles(title:" تعاریف دینى" , 
  image: Assets.images.a10a.path, text: """تعاریف دینى، مانند: «دین اعتراف به این حقیقت است که کلیه موجودات تجلیّات نیرویى هستند که فراتر از علم و معرفت ماست». (هربرت اسپنسر)[1]"""),

  
  Articles(title:" دین نفس الامری" ,
   image: Assets.images.a10a.path, text: """آنچه در علم الاهی و مشیت ربانی برای هدایت انسان به سوی رستگاری وجود دارد، دین نفس الامری است.
ب- دین مرسل: آنچه از سوی خداوند متعال برای هدایت انسان به سوی رستگاری به واسطه رسولان الاهی ارسال شده است، دین مرسل را تشکیل می دهد.

دین نفس الامری واحد است:
چون افراد آدمی با تمام تفاوت های ظاهری از گوهری مشترک برخوردارند، دین نفس الامری به همین گوهر مشترک نظر دارد."""),

  
  Articles(title:"دین مرسل" , image: Assets.images.a10a.path, text: """ آنچه از سوی خداوند متعال برای هدایت انسان به سوی رستگاری به واسطه رسولان الاهی ارسال شده است، دین مرسل را تشکیل می دهد.
  دین مرسل متعدد است:
واقعیت تاریخی ادیان، به شهادت تاریخ و قران گواه صادقی بر تعدد ادیان مرسل به تعداد رسولان الاهی است. در این جا مراد از رسول، نبی صاحب شریعت و مأمور به ابلاغ آن می باشد.[7] """),

  
  Articles(title:"ادیان توحیدی و غیر توحیدی" , 
  image: Assets.images.a10a.path, text: """ادیان از دید کلی به دو مجموعه تقسیم می شوند: توحیدی و غیرتوحیدی. مجموعه ادیان توحیدی (شامل یهودیت، مسیحیت، آیین زردشت و اسلام) به سه اصل توحید، نبوت و معاد قائلند، ولی ادیان غیرتوحیدی هیچ یک از این سه اصل را قبول ندارند: آن ادیان به جای توحید، از شرک و به جای نبوت، از حکمت[8] و به جای معاد، از تناسخ سخن می گویند. البته توحید مسیحیت با تثلیث و توحید آیین زردشت با ثنویت همراه است و پیروان هر دو دین می کوشند تثلیث و ثنویت خود را به هر قیمتی با اصل توحید هماهنگ کنند. درجه توفیق آنان در ایجاد این هماهنگی به داوری افراد گوناگون بستگی دارد: برخی از پیروان ادیان توحیدی بی درنگ آن را از ایشان می پذیرند، ولی برخی دیگر تسلیم تأویل های آنان نمی شوند و به پیروی از قرآن مجید[9] تثلیث را کفر می دانند.
در یک نگرش کلی، حقیقت همه ادیان توحیدی – که پیامبران الاهی مروج و مبلغ آن بوده اند – یکی است و بر اصول اعتقادی یگانه – که از جانب خداوند متعال بیان شده – استوار است. اساساً در منطق قرآن کریم، «ادیان» نداریم؛ بلکه «دین» داریم و تمام پیامبران، منادی «دین واحد» بوده اند که از آن به «اسلام» (تسلیم در برابر خداوند واحد) تعبیر شده است: «ان الدین عندالله الاسلام ؛ همانا دین در نزد خداوند فقط اسلام است» و «و من یبتغ غیرالاسلام دینا فلن یقبل منه ؛ هر کس غیر از اسلام دینی را برگزیند از او پذیرفته نیست».
قرآن کریم دین را فقط «اسلام» و همه پیامبران را «مسلمان» می خواند: «ما کان ابراهیم یهودیا و لا نصرانیا ولکن کان حنیفا مسلما»، ابراهیم نه یهودی بود و نه مسیحی؛ بلکه یکتاپرستی مسلمان بود.
بنابراین از دیدگاه قرآن مجید، همه پیامبران، مردم را به دین واحد؛ یعنی، اسلام، تسلیم و عبودیت در برابر خدای یگانه دعوت کرده اند و اصول و ارکان اعتقادی واحدی را تبلیغ کرده اند. بر این اساس، همه پیامبران از یک سلسله اصول مشترک و سنت های ثابت و واحدی پیروی می کردند، اصولی چون دعوت به تقوا، نفی شخصیت پرستی، دعوت به وحدت، تبشیر و انذار، تحمل دشمنی و استهزای جاهلان، دعوت به تعالی و .[10]"""),


  
  Articles(title:"تفاوت محیط و سطح و احتیاج ..." ,
   image: Assets.images.a10a.path, text: """تفاوت محیط و سطح و احتیاج و استعداد مردم:
این جهت غیر قابل انکار است که پیامبران برای هدایت مردم آمده اند؛ از این رو، نوع دستورها و سطح مطالب و معارف باید در حدود رشد و درک جامعه و نیازهای محیط باشد. طبعا بشر در قرون اولیه روابط اجتماعی بسیار محدودی داشت و نظام اجتماعی وی گسترش و تفصیل زیادی نداشت؛ از این رو، قوانین محدودی زندگی او را اداره و رهبری می کرد و همین طور آراء، اهواء، افکار و عقاید مختلفی در جامعه ابراز نشده بود، تا برای اصلاح، نیاز به تذکرات فراوان باشد و این گسترش افکار، روابط، شناخت و برخورد با عوامل طبیعی و نیازمندی ها رفته رفته موجبات پیدایش دعوت و رسالت و پیامبر جدیدی را فراهم می کرد تا سرانجام محیط دعوت اسلامی و شرایط آن، ابلاغ دعوت نهایی و کامل را ایجاب کرد."""),

Articles(title: 
"نقش زنان در ایجاد امنیت", image: Assets.images.a1a.path, text: """
نقش زنان در ایجاد امنیت اخلاقی و اجتماعی از منظر قرآن و روایات
دکتر سید عزت‌الله احمدی
امنیت اخلاقی همان فضایل انسانی است که عمل کردن به آن زمینه‌ساز آرامش فکری، روحی وروانی بوده و باعث تحکیم امنیت اجتماعی همه افراد بشر، به‌خصوص بانوان می‌شود و جامعه‌ای که امنیت آن در همه ابعاد (فردی، اجتماعی، سیاسی، معنوی و اقتصادی و...) کامل باشد؛ فساد و ناهنجاری‌های اخلاقی کاهش خواهد یافت. علاوه‌برآن، ثبات خانواده نیز تأمین می‌گردد. راه‌کارهایی که در دین مقدس اسلام جهت ایجاد و تقویت امنیت اخلاقی بیان گردیده، عبارتند از حفظ حجاب و عفت بانوان و اجتناب از پوشش نامناسب و سخنان ناپسند ...؛ قرآن کریم و روایات اهل‌بیت (ع)، باتوجه به ظرفیت‌ها و استعدادهای ظاهری و درونی مردان و زنان؛ مرزها و حدودی را بیان کرده است و ملاک برتری انسان را رعایت این مرزها یا عمل کردن به وظایف یعنی تقوا دانسته است.
"""),

Articles(title: "دلایل حجاب از نظر اخلاقی", image: Assets.images.a2a.path, text: 
"""
دلایل حجاب ازنظر اخلاقی
پوشیده بودن زن در حدودی که اسلام تعیین کرده است موجب کرامت و احترام بیشتر اوست؛ زیرا او را از تعرض افراد جلف و فاقد اخلاق حفظ می‌‌کند. حفظ حجاب، پوشیدگی و عفت زن از نشانه‌‌های کرامت اوست و برهنگی و بی‌‌عفتی موجب دورشدن از کرامت انسانی است. قرآن کریم به‌طور مکرر به حفظ حجاب و پوشش زنان توجه کرده است.

دلایل حجاب از نظر اخلاقی"""),

Articles(title: "چند دلیل عقلی ازمنظر حجاب", image: Assets.images.a4a.path, text: """
خلاصه این بیست دلیل عقلی بدین شرح است:
۱. آزادی فکر
۲. پوشیدگی؛ خواست فطرت
۳. پاسداری از آزادی اجتماعی
۴. تقویت فکر
۵. جذابیت بیشتر؛ لزوم محافظت افزون‌تر
۶. شیفتگی زن و مرد؛ محدود به حریم خانواده
۷. حفظ هویت ملی
۸. ارزش‌آفرینی برای زن
۹.بدن پوشیده تر ؛حیا کامل تر
۱۰.تحریک حداقلی 
۱۱.جلوگیری ازخشونت وآسیب
۱۲.زمینه سازی رشد علمی
۱۳.پیشگیری ازقانون شکنی
۱۴.مقایسه کردن همسر با زنان دیگر
۱۵.دفع چشم وفکرناپاک 
۱۶.میراندن میل به تعدد
۱۷.استحکام خانواده
۱۸.غیرت افزایی
۱۹.سلامت جسم
۲۰.رنگ مشکی ؛کمترین جاذبه"""),

Articles(title: "پوشش حجاب از نظر رسانه وهنری", image: Assets.images.a7a.path, text: 
"""
پوشش و حجاب به مثابة رسانه‌ای ارتباطی و به عنوان کنشی اجتماعی، از یک سو تحت تأثیر ساختارهای فرهنگی، اجتماعی، سیاسی و اقتصادی است و از سوی دیگر، متأثر از کنشگران اجتماعی اعم از زن و مرد می‌باشد. در طی سال‌های پس از انقلاب، بر اثر آسیب‌پذیری درونی جامعه و تهدیدهای بیرونی، انتقال فرهنگی حجاب با اختلال مواجه گردید و عدم رعایت حجاب اسلامی، موجب جریحه‌دار ساختن...
""")
];






